---
kind: other
id: Methods.T:Autodesk.Revit.ApplicationServices.ControlledApplication
source: html/98e731d9-c210-0137-c930-8199bc83558a.htm
---
# ControlledApplication Methods

Returns the instance of FailureDefinitionRegistry.